import sourceCode from "./assets/code(1).svg";

function App() {
  return (
    <main className="flex flex-col items-center">
      <a href="https://github.com/supernova-ge/Jipitauri" target="_blank" rel="noreferrer" className="self-start">
        <img src={sourceCode} alt="source-code" className="p-5" />
      </a>
      <section className="flex flex-col items-center lg:mt-10">
        <h1 className="text-2xl text-center">ჟიპიტაური, chatGPT-ის ქართულენოვანი ვერსია</h1>
        <p className="text-sm m-10 px-5 lg:w-4/6">
          დიდი ენობრივი მოდელები და მათზე დაფუძნებული სერვისები, როგორიც არის ChatGPT და სხვები, საოცარ შესაძლებლობებს აძლევს მათ, ვინც ინგლისურად წერს, კითხულობს და აზროვნებს. ინგლისურად ციფრული
          ტექსტის შექმნა ხდება გაცილებით მარტივი და სწრაფი. იმეილი, სტატია თუ რეცენზა საათების მაგივრად წამებში იწერება.
          <br />
          <br />
          ჩვენი მიზანია ამ მომენტისთვის ხელმისაწვდომი ტექნოლოგიების საშუალებით ChatGPT-ს მსგავსი სერვისი შევთავაზოთ ქართულენოვან მომხმარებლებს. სანაცვლოდ კი GPT-3-ს და ავტომატური თარგმანის მიერ
          დაბრუნებულ შედეგების შეფასებას გთხოვთ 👍.
          <br />
          <br />
          დაგროვებულ მონაცემებს გამოვიყენებთ თარგმანის ხარისხობრივი ანალიზისთვის და ღრმა ნეირონულ ქსელებზე დაფუძნებული ქართულ-ინგლისური (და შემდეგ სხვა ქართველური ენების) დიდი ენობრივი მოდელის
          შესაქმნელად.
          <br />
          <br />
          პირველ ეტაპზე შევაფასებთ რამდენად კარგად მუშაობს არსებული თარგმანი და ამოვიცნობთ ნაკლოვანებებს. ეს გვიკარნახებს სად ვეძიოთ სწორი მასალა შემდგომი გაუმჯობესებისთვის.
          <br />
          <br />
          შემდგომ ეტაპზე შევუდგებით სწორი მასალის (დატას) მოგროვებას და უფრო მეტი ადამიანის ჩრთვას გაცილებით უკეთესი ავომატური თარგმანის სისტემის შექმისთვის.
          <br />
          <br />
          ამ ყველაფრით მომავალში ქართულენოვანი ცოდნით გაჯერებული დიდი ენობრივი მოდელის შექმნას გვინდა საფუძველი ჩავუყაროთ.
          <br />
          <br />
          თუ დაინტერესებული ხართ ასეთ პროექტებში მონაწილეობით, ჩვენ ყოველთვის ვეძებთ საინტერესო ხალს თანამშრომლობისთვის, ასე რომ ნუ მოგერიდებათ, მოგვწერეთ{" "}
          <strong style={{ color: "#eaee0d" }}>hello@pulsarai.ge</strong> ან შემოგვიერთდით <a href="https://www.facebook.com/groups/1653527228396589">ფეისბუქ ჯგუფში</a> და{" "}
          <a href="https://discord.gg/UXVn8dUY"> დისქორდ სერვერზე </a>.
          <br />
          <br />
          ეს არის ავტომატიზირებული სისტემა რომელიც იყენებს open ai-ს მიერ შექმნილ ენობრივ მოდელს, რომელმაც შეიძლება დააგენერიროს ისეთი ტექსტი, რომელიც არ ეფუძნება ფაქტებს. ჩვენ არ ვიღებთ
          პასუხისმგებლობას ამ ინფორმაციის სრულყოფილებასა და სისწორეზე.
        </p>
      </section>
    </main>
  );
}

export default App;
