import sourceCode from "./assets/code(1).svg";
import result from "./assets/result.png";
import resultPrompt from "./assets/resultPrompt.png";

function App() {
  return (
    <main className="flex flex-col items-center">
      <a
        href="https://github.com/supernova-ge/Jipitauri"
        target="_blank"
        rel="noreferrer"
        className="self-start"
      >
        <img src={sourceCode} alt="source-code" className="p-5" />
      </a>
      <section className="flex flex-col items-center lg:mt-10">
        <h1 className="text-2xl text-center">
          ჟიპიტაური, chatGPT-ის ქართულენოვანი ვერსია
        </h1>
        <p className="text-sm m-10 px-5 lg:w-4/6">
          {" "}
          ალბათ, თქვენც გსმენიათ კითხვები, განხილვები თემაზე “რა საფრთხეს
          შეიცავს ხელოვნური ინტელექტი”. ჩვენ ამ კითხვას ყოველდღიურად ვისმენთ.
          “ჟიპიტაური” - ს ქართული აუდიტორიისათვის მიწოდება სწორედ ამ თემაზე
          თვალსაჩინო მაგალითით ცნობიერების ამაღლებას ემსახურება. ვფიქრობთ,
          შევძელით და ბევრი ადამიანი დავაფიქრეთ ამ საკითხზე. <br></br>
          <br></br>ცოტა ხნის წინ, კომპანია OpenAI - მ შექმნა ChatGPT, GPT3
          მოდელზე დაფუძნებული სერვისი, რომელიც მთელი ინტერნეტის მონაცემების
          დასწავლის შედეგად შეიქმნა. Შესაბამისად, მოდელს ცოდნა აქვს იმაზე
          დაყრდნობით, რაც ინფორმაციის დონეზე მოიპოვება ინტერნეტ სივრცეში. ამან
          თავის მხრივ გამოიწვია სხვადასხვა საკითხზე სუბიექტურად თუ ობიექტურად
          არარელევანტური პასუხები - ხელოვნური ინტელექტი რა აზრსაც უფრო მეტ
          ადგილას შეხვდება, ის “აზრი” ჩამოუყალიბდება და გაავრცელებს. <br></br>
          <br></br>
          ამ მაგალითით, კარგად ჩანს რას წარმოადგენს ხელოვნური ინტელექტის
          საფრთხე. ეს სხვადასხვა გამოყენებაში სხვადასხვანაირად შეიძლება
          რეალიზდეს - დიალოგში ამ მაგალითის მსგავსად, რობოტიკაში - სხვაგვარად,
          ფოტო-ვიდეო მასალის შექმნა გავრცელებაში კიდევ სხვა მხრივ და ა.შ.{" "}
          <br></br> <br></br>
          შესაბამისად, ხელოვნური ინტელექტის უკონტროლოდ განვითარება ან
          არაკეთილსინდისიერი ადამიანების მიერ გამოყენება საფრთხეს წარმოადგენს და
          ეს არა მხოლოდ მომავალში მოხდება, არამედ უკვე რეალობაა დღეს. მისია,
          რომელსაც AI შემქმნელები უნდა ემსახურებოდნენ, არის ის, რომ მისგან მეტი
          სარგებელი და ნაკლები რისკი მოდიოდეს. <br></br>
          <br></br> ეს პროექტი, ონლაინ გაშვების მომენტიდან, სწორედ საფრთხის
          მიმართ მოქმედების მაგალითს ემსახურება, “ჟიპიტაური” - ს პასუხები
          რუსეთ-საქართველოს და რუსეთ-უკრაინის ომზე ეფუძნებოდა იმ ინფორმაციას,
          რომელიც მონაცემებში უფრო მეტად შეხვედრია ხელოვნურ ინტელექტს, რაც თავის
          მხრივ, საინფორმაციო ომის შედეგს წარმოადგენს. Მაგალითად, თუკი ხელოვნურ
          ინტელექტს მიმართულებას მივცემთ ე.წ. “Prompting” - ით და სწორ
          ინფორმაციას მივაწვდით, მაშინ ის გაითვალისწინებს ამას თავის ცოდნაში და
          არასწორი ინფორმაციის გავრცელების რისკიც შემცირდება. თუმცა, ეს უფრო
          შედეგთან ბრძოლას გავს, ვიდრე მის გამომწვევ მიზეზთან. <br></br>
          <br></br>Prompting-ის სწორი გამოყენება უკვე არსებული ცოდნის გარდაქმნაა
          - სტილისტიკური მიბაძვა, მაგალითად გალაკტიონს რომ დაეწერა ამინდის
          პროგნოზი” ან “გრძელი სტატიის მოკლე შინაარსის შედგენა”. <br></br>
          <br></br>ჩვენ აქ საუბარი გვაქვს იმ ცოდნის სწორ მიწოდებაზე, რომელიც
          დასწავლისას დაილექა მოდელის მეხსიერებაში და ჩვენ ეხლა ვცდილობთ
          “ფრომფთინგით” გამოვუსწოროთ ადრეულ ეტაპზე დაშვებული შეცდომები - ეს არ
          არის მდგრადი გზა ასეთი მოდელების გამოყენების და არც ეკონომიკურადაა
          გამართლებული. <br></br>
          <br></br> რადგან OpenAI კომერციული ორგანიზაციაა და კონცენტრირებულია
          ინგლისურ ენაზე არსებულ ცოდნაზე, ისიც იმ ცოდნაზე, რომელიც ჩვენგან
          დასავლეთით უფრო იყრის თავს ინტერნეტში, ჩვენს რეგიონში მოვლენებზე და
          მათზე გავრცელებულ ინფორმაციის სიზუსტეზე ყურადღება და ენერგია ნაკლებად
          აქვს მიმართული. <br></br>
          <br></br>ამიტომ, საჭიროა დროულად ავუწყოთ ფეხი დიდი ენობრივი მოდელების
          შექმნის ტექნოლოგიებში დასავლეთს და შევქმნათ ჩვენი მოდელები, სადაც
          გვექნება სრული კონტროლი იმ რესურსებზე, რომლებზეც მოხდება დასწავლა და
          ისტორიული ფაქტების გამოგონებასაც ავარიდებთ თავს. <br></br>
          <br></br> სწორედ ამ მიზანს ემსახურება ექსპერიმენტი “ჟიპიტაური”, გვინდა
          დავფიქრდეთ ყველა და რეალურ მაგალითებზე წარმოვიდგინოთ ძალიან ახლო
          მომავალი, სადაც მსგავს ენობრივ მოდელებზე დაფუძნებული სერვისები
          არამხოლოდ ამერიკული კომპანიებიდან იქნება შემოთავაზებული, არამედ
          ნაკლებად პასუხისმგებლიანი სახელმწიფოებიდანაც და თუ ამ მაგალითზე რაც
          დავინახეთ, როდესაც OpenAI-ს მოდელი საქართველოს და უკრაინის მიმართ
          რუსეთის აგრესიის შესახებ არასწორ პასუხებს აბრუნებს, შეგვიძლია
          წარმოვიდგინოთ ასეთი მძლავრი მოდელები მტრულად განწყობილი სახელმწიფოების
          ხელში.
        </p>

        <p className="subtitle">Prompting-ის გარეშე</p>
        <img src={result} alt="res" width="70%"></img>
        <p className="subtitle">Prompting-ით</p>
        <img src={resultPrompt} alt="resProp" width="70%"></img>
        <p className="text-sm m-10 px-5 lg:w-4/6">
          დიდი ენობრივი მოდელები და მათზე დაფუძნებული სერვისები, როგორიც არის
          ChatGPT და სხვები, საოცარ შესაძლებლობებს აძლევს მათ, ვინც ინგლისურად
          წერს, კითხულობს და აზროვნებს. ინგლისურად ციფრული ტექსტის შექმნა ხდება
          გაცილებით მარტივი და სწრაფი. იმეილი, სტატია თუ რეცენზა საათების
          მაგივრად წამებში იწერება.
          <br />
          <br />
          ჩვენი მიზანია ამ მომენტისთვის ხელმისაწვდომი ტექნოლოგიების საშუალებით
          ChatGPT-ს მსგავსი სერვისი შევთავაზოთ ქართულენოვან მომხმარებლებს.
          სანაცვლოდ კი GPT-3-ს და ავტომატური თარგმანის მიერ დაბრუნებულ შედეგების
          შეფასებას გთხოვთ 👍.
          <br />
          <br />
          დაგროვებულ მონაცემებს გამოვიყენებთ თარგმანის ხარისხობრივი ანალიზისთვის
          და ღრმა ნეირონულ ქსელებზე დაფუძნებული ქართულ-ინგლისური (და შემდეგ სხვა
          ქართველური ენების) დიდი ენობრივი მოდელის შესაქმნელად.
          <br />
          <br />
          პირველ ეტაპზე შევაფასებთ რამდენად კარგად მუშაობს არსებული თარგმანი და
          ამოვიცნობთ ნაკლოვანებებს. ეს გვიკარნახებს სად ვეძიოთ სწორი მასალა
          შემდგომი გაუმჯობესებისთვის.
          <br />
          <br />
          შემდგომ ეტაპზე შევუდგებით სწორი მასალის (დატას) მოგროვებას და უფრო
          მეტი ადამიანის ჩრთვას გაცილებით უკეთესი ავომატური თარგმანის სისტემის
          შექმისთვის.
          <br />
          <br />
          ამ ყველაფრით მომავალში ქართულენოვანი ცოდნით გაჯერებული დიდი ენობრივი
          მოდელის შექმნას გვინდა საფუძველი ჩავუყაროთ.
          <br />
          <br />
          თუ დაინტერესებული ხართ ასეთ პროექტებში მონაწილეობით, ჩვენ ყოველთვის
          ვეძებთ საინტერესო ხალს თანამშრომლობისთვის, ასე რომ ნუ მოგერიდებათ,
          მოგვწერეთ{" "}
          <strong style={{ color: "#eaee0d" }}>hello@pulsarai.ge</strong> ან
          შემოგვიერთდით{" "}
          <a href="https://www.facebook.com/groups/1653527228396589">
            ფეისბუქ ჯგუფში
          </a>{" "}
          და <a href="https://discord.gg/UXVn8dUY"> დისქორდ სერვერზე </a>.
          <br />
          <br />
          გაფრთხილება &#x2757;&#x2757;&#x2757;
          <br />
          ეს არის ავტომატიზირებული სისტემა რომელიც იყენებს open ai-ს მიერ
          შექმნილ ენობრივ მოდელს, რომელმაც შეიძლება დააგენერიროს ისეთი ტექსტი,
          რომელიც არ ეფუძნება ფაქტებს. ჩვენ არ ვიღებთ პასუხისმგებლობას ამ
          ინფორმაციის სრულყოფილებასა და სისწორეზე.
        </p>
      </section>
    </main>
  );
}

export default App;
