import React, { FC } from "react";
interface PopupProps {
  showPopup: boolean;
  setShowPopup: React.Dispatch<React.SetStateAction<boolean>>;
}

const Popup: FC<PopupProps> = ({ showPopup, setShowPopup }) => {
  return (
    <div
      className="bg-bg-secondary absolute bottom-5 w-95 flex flex-col items-center justify-between rounded-xl pb-5 text-md text-white-100 left-2 lg:w-50 xl:w-50 2xl:w-50 lg:left-72 xl:left-96 2xl:left-96"
      style={{
        // left: "2.5%",
        display: showPopup ? "flex" : "none",
        maxHeight: "calc(100% - 200px)",
        overflowY: "auto",
      }}
    >
      {/* <button
        type="button"
        className="self-end px-5 py-2 text-xl"
        onClick={() => setShowPopup(false)}
      >
        x
      </button> */}
      <p className="self-start px-5 pb-20 pt-5">
        {" "}
        ალბათ, თქვენც გსმენიათ კითხვები, განხილვები თემაზე “რა საფრთხეს შეიცავს
        ხელოვნური ინტელექტი”. ჩვენ ამ კითხვას ყოველდღიურად ვისმენთ. “ჟიპიტაური”
        - ს ქართული აუდიტორიისათვის მიწოდება სწორედ ამ თემაზე თვალსაჩინო
        მაგალითით ცნობიერების ამაღლებას ემსახურება. ვფიქრობთ, შევძელით და ბევრი
        ადამიანი დავაფიქრეთ ამ საკითხზე. <br></br>
        <br></br>ცოტა ხნის წინ, კომპანია OpenAI - მ შექმნა ChatGPT, GPT3 მოდელზე
        დაფუძნებული სერვისი, რომელიც მთელი ინტერნეტის მონაცემების დასწავლის
        შედეგად შეიქმნა. Შესაბამისად, მოდელს ცოდნა აქვს იმაზე დაყრდნობით, რაც
        ინფორმაციის დონეზე მოიპოვება ინტერნეტ სივრცეში. ამან თავის მხრივ
        გამოიწვია სხვადასხვა საკითხზე სუბიექტურად თუ ობიექტურად არარელევანტური
        პასუხები - ხელოვნური ინტელექტი რა აზრსაც უფრო მეტ ადგილას შეხვდება, ის
        “აზრი” ჩამოუყალიბდება და გაავრცელებს. <br></br>
        <br></br>
        ამ მაგალითით, კარგად ჩანს რას წარმოადგენს ხელოვნური ინტელექტის საფრთხე.
        ეს სხვადასხვა გამოყენებაში სხვადასხვანაირად შეიძლება რეალიზდეს -
        დიალოგში ამ მაგალითის მსგავსად, რობოტიკაში - სხვაგვარად, ფოტო-ვიდეო
        მასალის შექმნა გავრცელებაში კიდევ სხვა მხრივ და ა.შ. <br></br> <br></br>
        შესაბამისად, ხელოვნური ინტელექტის უკონტროლოდ განვითარება ან
        არაკეთილსინდისიერი ადამიანების მიერ გამოყენება საფრთხეს წარმოადგენს და
        ეს არა მხოლოდ მომავალში მოხდება, არამედ უკვე რეალობაა დღეს. მისია,
        რომელსაც AI შემქმნელები უნდა ემსახურებოდნენ, არის ის, რომ მისგან მეტი
        სარგებელი და ნაკლები რისკი მოდიოდეს. <br></br>
        <br></br> ეს პროექტი, ონლაინ გაშვების მომენტიდან, სწორედ საფრთხის მიმართ
        მოქმედების მაგალითს ემსახურება, “ჟიპიტაური” - ს პასუხები
        რუსეთ-საქართველოს და რუსეთ-უკრაინის ომზე ეფუძნებოდა იმ ინფორმაციას,
        რომელიც მონაცემებში უფრო მეტად შეხვედრია ხელოვნურ ინტელექტს, რაც თავის
        მხრივ, საინფორმაციო ომის შედეგს წარმოადგენს. Მაგალითად, თუკი ხელოვნურ
        ინტელექტს მიმართულებას მივცემთ ე.წ. “Prompting” - ით და სწორ ინფორმაციას
        მივაწვდით, მაშინ ის გაითვალისწინებს ამას თავის ცოდნაში და არასწორი
        ინფორმაციის გავრცელების რისკიც შემცირდება. თუმცა, ეს უფრო შედეგთან
        ბრძოლას გავს, ვიდრე მის გამომწვევ მიზეზთან. <br></br>
        <br></br>Prompting-ის სწორი გამოყენება უკვე არსებული ცოდნის გარდაქმნაა -
        სტილისტიკური მიბაძვა, მაგალითად გალაკტიონს რომ დაეწერა ამინდის პროგნოზი”
        ან “გრძელი სტატიის მოკლე შინაარსის შედგენა”. <br></br>
        <br></br>ჩვენ აქ საუბარი გვაქვს იმ ცოდნის სწორ მიწოდებაზე, რომელიც
        დასწავლისას დაილექა მოდელის მეხსიერებაში და ჩვენ ეხლა ვცდილობთ
        “ფრომფთინგით” გამოვუსწოროთ ადრეულ ეტაპზე დაშვებული შეცდომები - ეს არ
        არის მდგრადი გზა ასეთი მოდელების გამოყენების და არც ეკონომიკურადაა
        გამართლებული. <br></br>
        <br></br> რადგან OpenAI კომერციული ორგანიზაციაა და კონცენტრირებულია
        ინგლისურ ენაზე არსებულ ცოდნაზე, ისიც იმ ცოდნაზე, რომელიც ჩვენგან
        დასავლეთით უფრო იყრის თავს ინტერნეტში, ჩვენს რეგიონში მოვლენებზე და
        მათზე გავრცელებულ ინფორმაციის სიზუსტეზე ყურადღება და ენერგია ნაკლებად
        აქვს მიმართული. <br></br>
        <br></br>ამიტომ, საჭიროა დროულად ავუწყოთ ფეხი დიდი ენობრივი მოდელების
        შექმნის ტექნოლოგიებში დასავლეთს და შევქმნათ ჩვენი მოდელები, სადაც
        გვექნება სრული კონტროლი იმ რესურსებზე, რომლებზეც მოხდება დასწავლა და
        ისტორიული ფაქტების გამოგონებასაც ავარიდებთ თავს. <br></br>
        <br></br> სწორედ ამ მიზანს ემსახურება ექსპერიმენტი “ჟიპიტაური”, გვინდა
        დავფიქრდეთ ყველა და რეალურ მაგალითებზე წარმოვიდგინოთ ძალიან ახლო
        მომავალი, სადაც მსგავს ენობრივ მოდელებზე დაფუძნებული სერვისები არამხოლოდ
        ამერიკული კომპანიებიდან იქნება შემოთავაზებული, არამედ ნაკლებად
        პასუხისმგებლიანი სახელმწიფოებიდანაც და თუ ამ მაგალითზე რაც დავინახეთ,
        როდესაც OpenAI-ს მოდელი საქართველოს და უკრაინის მიმართ რუსეთის აგრესიის
        შესახებ არასწორ პასუხებს აბრუნებს, შეგვიძლია წარმოვიდგინოთ ასეთი მძლავრი
        მოდელები მტრულად განწყობილი სახელმწიფოების ხელში.
      </p>
      {/* <footer>©სუპერნოვა</footer> */}
      <button onClick={() => setShowPopup(false)}>დახურვა</button>
    </div>
  );
};

export default Popup;
